results/runs/ycsb/2026-05-17T10-46-48/mongodb/load_workload_e.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p threadcount=10 -p mongodb.upsert=true -p core_workload_insertion_retry_limit=10
Command line: -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p threadcount=10 -p mongodb.upsert=true -p core_workload_insertion_retry_limit=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-17 10:46:03:243 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongodb:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 10:46:09:847 6 sec: 100000 operations; 15060.24 current ops/sec; [CLEANUP: Count=10, Max=6171, Min=1, Avg=622.5, 90=17, 99=6171, 99.9=6171, 99.99=6171] [INSERT: Count=100000, Max=386047, Min=234, Avg=673.08, 90=1025, 99=3645, 99.9=8367, 99.99=36447] 
[OVERALL], RunTime(ms), 6640
[OVERALL], Throughput(ops/sec), 15060.240963855422
[TOTAL_GCS_G1_Young_Generation], Count, 23
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 77
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.1596385542168675
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 23
[TOTAL_GC_TIME], Time(ms), 77
[TOTAL_GC_TIME_%], Time(%), 1.1596385542168675
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 622.5
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 6171
[CLEANUP], 95thPercentileLatency(us), 6171
[CLEANUP], 99thPercentileLatency(us), 6171
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 673.07794
[INSERT], MinLatency(us), 234
[INSERT], MaxLatency(us), 386047
[INSERT], 95thPercentileLatency(us), 1534
[INSERT], 99thPercentileLatency(us), 3645
[INSERT], Return=OK, 100000